## Missing data

In [19]:
import pandas as pd
import numpy as np

In [20]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}
d

{'A': [1, 2, nan], 'B': [5, nan, nan], 'C': [1, 2, 3]}

In [21]:
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [22]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [23]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [24]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [25]:
df.dropna(thresh=2, axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [26]:
df.fillna(value = 'Hello world')

             A            B  C
0          1.0          5.0  1
1          2.0  Hello world  2
2  Hello world  Hello world  3

In [31]:
df.fillna(value = '3')

     A    B  C
0  1.0  5.0  1
1  2.0    3  2
2    3    3  3

In [32]:
df['A'].fillna(value = 3)

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [28]:
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [29]:
df['A'].fillna(value = df['A'].median())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64